pip install --upgrade pip

In [11]:
import pandas as pd
data = pd.read_csv("company1 (1).csv")
print(data)
print(data["salary"].duplicated().sum())

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0
3

In [12]:
print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [13]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [14]:
print(data["salary"].mean())

24400.0

In [20]:
import numpy as np
data["salary"]=data["salary"].replace(np.nan, 24400)
print(data)
data["Bonus"]= (data["salary"]/100)*20
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0
    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F  24400.0  4880.0
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali    NaN  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05       NaN      M  25000.0  5000.0
5  EMP06     rohit      M  24400.0  4880.0
6  EMP02     rohit      M  25000.0  5000.0

In [ ]:
print(data["salary"].mean())

In [ ]:
print(data.fillna(method= 'bfill'))

In [ ]:
print(data.fillna(method='ffill'))

#Column Transformantion Method

In [16]:
import pandas as pd 
df = pd.read_excel("ESD.xlsx")
df.loc[(df["Bonus %"] == 0),"GetBonus"] = "No bonus"
df.loc[(df["Bonus %"] > 0), "GetBonus"] = "Bonus"
print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date  GetBonus
0       0.15  United States    Seattle 2021-10-16     Bonus
1       0.00          China  Chongqing        NaT  No bonus
2       0.20  United States    Chicago        NaT     Bonus
3       0.07  United States    Chicago        NaT     Bonus
4       0.00  United States    Phoenix        NaT  No bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  No bonus
996     0.00          China    Chengdu 2018-01-08  No bonus
997     0.15  United States      Miami        NaT     Bonus
998     0.00          China    Chengdu        NaT  No bonus
999     0.31  United States      Miami        NaT     Bonus

[1000 rows x 15 columns]

Shorting the Name by three letter

In [21]:
data = {"Months":["January", "February", "March", "April"]}
a = pd.DataFrame(data)
def extract(value):
    return value[0:3]
a["Short_month"] = a["Months"].map(extract)
print(a)

     Months Short_month
0   January         Jan
1  February         Feb
2     March         Mar
3     April         Apr

Groupby in pandas

In [23]:
data = pd.read_excel("ESD.xlsx")
print(data.head(15))

      EEID        Full Name                 Job Title       Department  \
0   E02387      Emily Davis                Sr. Manger               IT
1   E04105    Theodore Dinh       Technical Architect               IT
2   E02572     Luna Sanders                  Director          Finance
3   E02832  Penelope Jordan  Computer Systems Manager               IT
4   E01639        Austin Vo               Sr. Analyst          Finance
5   E00644     Joshua Gupta    Account Representative            Sales
6   E01550      Ruby Barnes                   Manager               IT
7   E04332      Luke Martin                   Analyst          Finance
8   E04533    Easton Bailey                   Manager       Accounting
9   E03838  Madeline Walker               Sr. Analyst          Finance
10  E00591     Savannah Ali                Sr. Manger  Human Resources
11  E03344    Camila Rogers         Controls Engineer      Engineering
12  E00530        Eli Jones                   Manager  Human Resources
13  E04239     Everleigh Ng                Sr. Manger          Finance
14  E03496      Robert Yang               Sr. Analyst       Accounting

             Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0   Research & Development  Female      Black   55 2016-04-08         141604
1            Manufacturing    Male      Asian   59 1997-11-29          99975
2      Speciality Products  Female  Caucasian   50 2006-10-26         163099
3            Manufacturing  Female  Caucasian   26 2019-09-27          84913
4            Manufacturing    Male      Asian   55 1995-11-20          95409
5                Corporate    Male      Asian   57 2017-01-24          50994
6                Corporate  Female  Caucasian   27 2020-07-01         119746
7            Manufacturing    Male      Black   25 2020-05-16          41336
8            Manufacturing    Male  Caucasian   29 2019-01-25         113527
9      Speciality Products  Female  Caucasian   34 2018-06-13          77203
10           Manufacturing  Female      Asian   36 2009-02-11         157333
11     Speciality Products  Female  Caucasian   27 2021-10-21         109851
12           Manufacturing    Male  Caucasian   59 1999-03-14         105086
13  Research & Development  Female      Asian   51 2021-06-10         146742
14     Speciality Products    Male      Asian   31 2017-11-04          97078

    Bonus %        Country       City  Exit Date
0      0.15  United States    Seattle 2021-10-16
1      0.00          China  Chongqing        NaT
2      0.20  United States    Chicago        NaT
3      0.07  United States    Chicago        NaT
4      0.00  United States    Phoenix        NaT
5      0.00          China  Chongqing        NaT
6      0.10  United States    Phoenix        NaT
7      0.00  United States      Miami 2021-05-20
8      0.06  United States     Austin        NaT
9      0.00  United States    Chicago        NaT
10     0.15  United States      Miami        NaT
11     0.00  United States    Seattle        NaT
12     0.09  United States     Austin        NaT
13     0.10          China   Shanghai        NaT
14     0.00  United States     Austin 2020-03-09

In [29]:
gp = data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [33]:
gp1 = data.groupby("Country").agg({"Age":"mean"})
print(gp1)

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512

In [35]:
gp2= data.groupby(["Country","Gender"]).agg({"Annual Salary":"max"})
print(gp2)

                      Annual Salary
Country       Gender
Brazil        Female         258426
              Male           249506
China         Female         249686
              Male           257194
United States Female         258498
              Male           258081

Merg, Join and Concanate

In [47]:
import pandas as pd 
data1 = {"EmpId":["E01","E02","E03","E04","E05"],
         "Names":["Johan","Rohan", "Mohan","Sohan","Tony"],
         "Age":[21,22,23,44,32]}
data2 = {"EmpId":["E01","E02","E03","E04","E05"],
         "Salary":[45000,56000,78000,87000,45000]}
df1 = pd.DataFrame(data1)
print(df1)
df2 = pd.DataFrame(data2)
print(df2)

  EmpId  Names  Age
0   E01  Johan   21
1   E02  Rohan   22
2   E03  Mohan   23
3   E04  Sohan   44
4   E05   Tony   32
  EmpId  Salary
0   E01   45000
1   E02   56000
2   E03   78000
3   E04   87000
4   E05   45000

In [51]:
df = pd.merge(df1,df2 ,on= "EmpId")
print(df)

  EmpId  Names  Age  Salary
0   E01  Johan   21   45000
1   E02  Rohan   22   56000
2   E03  Mohan   23   78000
3   E04  Sohan   44   87000
4   E05   Tony   32   45000

In [55]:
dff= pd.join(df1,df2)
print(dff)

AttributeError: module 'pandas' has no attribute 'join'

In [58]:
import pandas as pd 
data1 = {"EmpId":["E01","E02","E03","E04","E05"],
         "Names":["Johan","Rohan", "Mohan","Sohan","Tony"],
         "Age":[21,22,23,44,32]}
data2 = {"EmpId":["E06","E07","E08","E09","E10"],
         "Names":["Rakesh","Aditi", "vivba","hema","ganu"],
         "Age":[21,22,23,44,32]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [59]:
print(pd.concat([df1,df2]))

  EmpId   Names  Age
0   E01   Johan   21
1   E02   Rohan   22
2   E03   Mohan   23
3   E04   Sohan   44
4   E05    Tony   32
0   E06  Rakesh   21
1   E07   Aditi   22
2   E08   vivba   23
3   E09    hema   44
4   E10    ganu   32

Compare Dataframes

In [75]:
import pandas as pd
dict = {"Fruits":["mago", "apple","pea","bana","papaya"],
        "Prices":[100,450,780,888,990],
        "Quantity":[15,12,23,20,25]}
df = pd.DataFrame(dict)
print(df)
df2= df.copy()
df2.loc[0,"Price"]=120
df2.loc[1,"Price"]=175
df2.loc[3,"Price"]=30
df2.loc[0,"Quantity"]=10
df2.loc[1,"Quantity"]=15
df2.loc[3,"Quantity"]=3
print(df2)
df, df2 = df.align(df2, join='inner', axis=1)
print(df.compare(df2, keep_shape=False))

   Fruits  Prices  Quantity
0    mago     100        15
1   apple     450        12
2     pea     780        23
3    bana     888        20
4  papaya     990        25
   Fruits  Prices  Quantity  Price
0    mago     100        10  120.0
1   apple     450        15  175.0
2     pea     780        23    NaN
3    bana     888         3   30.0
4  papaya     990        25    NaN
  Quantity
      self other
0     15.0  10.0
1     12.0  15.0
3     20.0   3.0

Pivoting and Melting Data Frame

In [7]:
import pandas as pd
dict = {"keys": ["k1","k2", "k3", "k4"],
        "Name": ["Johan", "Ben", "David", "Peter"],
        "Houses": ["red", "blue", "green","red"],
       "Grades":["3rd","8th","9th","7th"]}
df = pd.DataFrame(dict)
print(df)
print(df.pivot(index="keys",columns="Name",values=["Houses","Grades"]))

  keys   Name Houses Grades
0   k1  Johan    red    3rd
1   k2    Ben   blue    8th
2   k3  David  green    9th
3   k4  Peter    red    7th
     Houses                    Grades
Name    Ben  David Johan Peter    Ben David Johan Peter
keys
k1      NaN    NaN   red   NaN    NaN   NaN   3rd   NaN
k2     blue    NaN   NaN   NaN    8th   NaN   NaN   NaN
k3      NaN  green   NaN   NaN    NaN   9th   NaN   NaN
k4      NaN    NaN   NaN   red    NaN   NaN   NaN   7th

In [12]:
import pandas as pd
dict = {"Name": ["Johan", "Ben", "David", "Peter"],
        "Houses": ["red", "blue", "green","red"],
       "Grades":["3rd","8th","9th","7th"]}
df = pd.DataFrame(dict)
print(df)
print(pd.melt(df, id_vars=["Name"],value_vars=["Houses","Grades"]))

    Name Houses Grades
0  Johan    red    3rd
1    Ben   blue    8th
2  David  green    9th
3  Peter    red    7th
    Name variable  value
0  Johan   Houses    red
1    Ben   Houses   blue
2  David   Houses  green
3  Peter   Houses    red
4  Johan   Grades    3rd
5    Ben   Grades    8th
6  David   Grades    9th
7  Peter   Grades    7th